NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM24/MGM240PA22VNA.svd
        <register>
          <name>ARRAY3ADDRCFG</name>
          <description>Array N Base Address Register</description>
          <addressOffset>0x0B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASE</name>
              <description>Array Base Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARRAY3DIM0CFG</name>
          <description>Array N Dimenion 0 Configuration</description>
          <addressOffset>0x0B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002000</resetValue>
          <resetMask>0x0FFF73FF</resetMask>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Array Dimension Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASETYPE</name>
              <description>Element Type</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UINT8</name>
                  <description>Data is unsigned 8-bit integer (can only be used for loads) </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT8</name>
                  <description>Data is signed 8-bit integer (can only be used for loads)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BINARY16</name>
                  <description>Data is 16-bit float</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved.  Invalid data if this is specified. </description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPLEX</name>
              <description>Complex Data Type</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALAR</name>
                  <description>Data represents a scalar number</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEX</name>
                  <description>Data represents a complex pair or packed pair of reals.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRIDE</name>
              <description>Dimension Stride Step</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARRAY3DIM1CFG</name>
          <description>Array N Dimenion 1 Configuration</description>
          <addressOffset>0x0BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF03FF</resetMask>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Array Dimension Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STRIDE</name>
              <description>Dimension Stride Step</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARRAY3DIM2CFG</name>
          <description>Array N Dimenion 2 Configuration</description>
          <addressOffset>0x0C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF03FF</resetMask>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Array Dimension Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STRIDE</name>
              <description>Dimension Stride Step</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARRAY4ADDRCFG</name>
          <description>Array N Base Address Register</description>
          <addressOffset>0x0C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASE</name>
              <description>Array Base Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARRAY4DIM0CFG</name>
          <description>Array N Dimenion 0 Configuration</description>
          <addressOffset>0x0C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002000</resetValue>
          <resetMask>0x0FFF73FF</resetMask>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Array Dimension Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASETYPE</name>
              <description>Element Type</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UINT8</name>
                  <description>Data is unsigned 8-bit integer (can only be used for loads) </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT8</name>
                  <description>Data is signed 8-bit integer (can only be used for loads)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BINARY16</name>
                  <description>Data is 16-bit float</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved.  Invalid data if this is specified. </description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPLEX</name>
              <description>Complex Data Type</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALAR</name>
                  <description>Data represents a scalar number</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLEX</name>
                  <description>Data represents a complex pair or packed pair of reals.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRIDE</name>
              <description>Dimension Stride Step</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARRAY4DIM1CFG</name>
          <description>Array N Dimenion 1 Configuration</description>
          <addressOffset>0x0CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF03FF</resetMask>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Array Dimension Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STRIDE</name>
              <description>Dimension Stride Step</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARRAY4DIM2CFG</name>
          <description>Array N Dimenion 2 Configuration</description>
          <addressOffset>0x0D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF03FF</resetMask>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Array Dimension Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STRIDE</name>
              <description>Dimension Stride Step</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOOP0CFG</name>
          <description>Loop N Configuration Register</description>
          <addressOffset>0x0D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x777773FF</resetMask>
          <fields>
            <field>
              <name>NUMITERS</name>
              <description>Number of Iterations</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY0INCRDIM0</name>
              <description>Increment Dimension 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY0INCRDIM1</name>
              <description>Increment Dimension 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY0INCRDIM2</name>
              <description>Increment Dimension 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY1INCRDIM0</name>
              <description>Increment Dimension 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY1INCRDIM1</name>
              <description>Increment Dimension 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY1INCRDIM2</name>
              <description>Increment Dimension 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY2INCRDIM0</name>
              <description>Increment Dimension 0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY2INCRDIM1</name>
              <description>Increment Dimension 1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY2INCRDIM2</name>
              <description>Increment Dimension 2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY3INCRDIM0</name>
              <description>Increment Dimension 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY3INCRDIM1</name>
              <description>Increment Dimension 1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY3INCRDIM2</name>
              <description>Increment Dimension 2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY4INCRDIM0</name>
              <description>Increment Dimension 0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY4INCRDIM1</name>
              <description>Increment Dimension 1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY4INCRDIM2</name>
              <description>Increment Dimension 2</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOOP0RST</name>
          <description>Loop N Reset Configuration Register</description>
          <addressOffset>0x0D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x77777000</resetMask>
          <fields>
            <field>
              <name>ARRAY0RESETDIM0</name>
              <description>Reset Dimension 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY0RESETDIM1</name>
              <description>Reset Dimension 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY0RESETDIM2</name>
              <description>Reset Dimension 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY1RESETDIM0</name>
              <description>Reset Dimension 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY1RESETDIM1</name>
              <description>Reset Dimension 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY1RESETDIM2</name>
              <description>Reset Dimension 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY2RESETDIM0</name>
              <description>Reset Dimension 0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY2RESETDIM1</name>
              <description>Reset Dimension 1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY2RESETDIM2</name>
              <description>Reset Dimension 2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY3RESETDIM0</name>
              <description>Reset Dimension 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY3RESETDIM1</name>
              <description>Reset Dimension 1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY3RESETDIM2</name>
              <description>Reset Dimension 2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY4RESETDIM0</name>
              <description>Reset Dimension 0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY4RESETDIM1</name>
              <description>Reset Dimension 1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY4RESETDIM2</name>
              <description>Reset Dimension 2</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOOP1CFG</name>
          <description>Loop N Configuration Register</description>
          <addressOffset>0x0DC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x777773FF</resetMask>
          <fields>
            <field>
              <name>NUMITERS</name>
              <description>Number of Iterations</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY0INCRDIM0</name>
              <description>Increment Dimension 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY0INCRDIM1</name>
              <description>Increment Dimension 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY0INCRDIM2</name>
              <description>Increment Dimension 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY1INCRDIM0</name>
              <description>Increment Dimension 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY1INCRDIM1</name>
              <description>Increment Dimension 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY1INCRDIM2</name>
              <description>Increment Dimension 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY2INCRDIM0</name>
              <description>Increment Dimension 0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY2INCRDIM1</name>
              <description>Increment Dimension 1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY2INCRDIM2</name>
              <description>Increment Dimension 2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY3INCRDIM0</name>
              <description>Increment Dimension 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY3INCRDIM1</name>
              <description>Increment Dimension 1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY3INCRDIM2</name>
              <description>Increment Dimension 2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY4INCRDIM0</name>
              <description>Increment Dimension 0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY4INCRDIM1</name>
              <description>Increment Dimension 1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRAY4INCRDIM2</name>
              <description>Increment Dimension 2</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
